zthxxx/STM32-W5500_TCP_Client/USER/W5500.c
/*******************************************************************************
* 函数名  : Write_W5500_2Byte
* 描述    : 通过SPI向指定地址寄存器写2个字节数据
* 输入    : reg:16位寄存器地址,dat:16位待写入的数据(2个字节)
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_2Byte(uint16_t reg, uint16_t dat)
{
	W5500_SCS_Low();//置W5500的SCS为低电平
		
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM2|RWB_WRITE|COMMON_R);//通过SPI写控制字节,2个字节数据长度,写数据,选择通用寄存器
	W5500_SPI_Send_Short(dat);//写16位数据

	W5500_SCS_High(); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_nByte
* 描述    : 通过SPI向指定地址寄存器写n个字节数据
* 输入    : reg:16位寄存器地址,*dat_ptr:待写入数据缓冲区指针,size:待写入的数据长度
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_nByte(uint16_t reg, uint8_t *dat_ptr, uint16_t size)
{
	uint16_t i;

	W5500_SCS_Low();//置W5500的SCS为低电平	
		
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(VDM|RWB_WRITE|COMMON_R);//通过SPI写控制字节,N个字节数据长度,写数据,选择通用寄存器

	for(i=0;i<size;i++)//循环将缓冲区的size个字节数据写入W5500
	{
		W5500_SPI_Send_Byte(*dat_ptr++);//写一个字节数据
	}

	W5500_SCS_High(); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_1Byte
* 描述    : 通过SPI向指定端口寄存器写1个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,dat:待写入的数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_1Byte(SOCKET s, uint16_t reg, uint8_t dat)
{
	W5500_SCS_Low();//置W5500的SCS为低电平	
		
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM1|RWB_WRITE|(s*0x20+0x08));//通过SPI写控制字节,1个字节数据长度,写数据,选择端口s的寄存器
	W5500_SPI_Send_Byte(dat);//写1个字节数据

	W5500_SCS_High(); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_2Byte
* 描述    : 通过SPI向指定端口寄存器写2个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,dat:16位待写入的数据(2个字节)
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_2Byte(SOCKET s, uint16_t reg, uint16_t dat)
{
	W5500_SCS_Low();//置W5500的SCS为低电平
			
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM2|RWB_WRITE|(s*0x20+0x08));//通过SPI写控制字节,2个字节数据长度,写数据,选择端口s的寄存器
	W5500_SPI_Send_Short(dat);//写16位数据

	W5500_SCS_High(); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_4Byte
* 描述    : 通过SPI向指定端口寄存器写4个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,*dat_ptr:待写入的4个字节缓冲区指针
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_4Byte(SOCKET s, uint16_t reg, uint8_t *dat_ptr)
{
	W5500_SCS_Low();//置W5500的SCS为低电平
			
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM4|RWB_WRITE|(s*0x20+0x08));//通过SPI写控制字节,4个字节数据长度,写数据,选择端口s的寄存器

	W5500_SPI_Send_Byte(*dat_ptr++);//写第1个字节数据
	W5500_SPI_Send_Byte(*dat_ptr++);//写第2个字节数据
	W5500_SPI_Send_Byte(*dat_ptr++);//写第3个字节数据
	W5500_SPI_Send_Byte(*dat_ptr++);//写第4个字节数据

	W5500_SCS_High(); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Read_W5500_1Byte
* 描述    : 读W5500指定地址寄存器的1个字节数据
* 输入    : reg:16位寄存器地址
* 输出    : 无
* 返回值  : 读取到寄存器的1个字节数据
* 说明    : 无
*******************************************************************************/
uint8_t Read_W5500_1Byte(uint16_t reg)
{
	uint8_t i;

	W5500_SCS_Low();//置W5500的SCS为低电平
			
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM1|RWB_READ|COMMON_R);//通过SPI写控制字节,1个字节数据长度,读数据,选择通用寄存器

	i=W5500_SPI_Receive_Data();
	W5500_SPI_Send_Byte(0x00);//发送一个哑数据
	i=W5500_SPI_Receive_Data();//读取1个字节数据

	W5500_SCS_High();//置W5500的SCS为高电平
	return i;//返回读取到的寄存器数据
}

/*******************************************************************************
* 函数名  : Read_W5500_SOCK_1Byte
* 描述    : 读W5500指定端口寄存器的1个字节数据
* 输入    : s:端口号,reg:16位寄存器地址
* 输出    : 无
* 返回值  : 读取到寄存器的1个字节数据
* 说明    : 无
*******************************************************************************/
uint8_t Read_W5500_SOCK_1Byte(SOCKET s, uint16_t reg)
{
	uint8_t i;

	W5500_SCS_Low();//置W5500的SCS为低电平
			
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM1|RWB_READ|(s*0x20+0x08));//通过SPI写控制字节,1个字节数据长度,读数据,选择端口s的寄存器

	i=W5500_SPI_Receive_Data();
	W5500_SPI_Send_Byte(0x00);//发送一个哑数据
	i=W5500_SPI_Receive_Data();//读取1个字节数据

	W5500_SCS_High();//置W5500的SCS为高电平
	return i;//返回读取到的寄存器数据
}

/*******************************************************************************
* 函数名  : Read_W5500_SOCK_2Byte
* 描述    : 读W5500指定端口寄存器的2个字节数据
* 输入    : s:端口号,reg:16位寄存器地址
* 输出    : 无
* 返回值  : 读取到寄存器的2个字节数据(16位)
* 说明    : 无
*******************************************************************************/
uint16_t Read_W5500_SOCK_2Byte(SOCKET s, uint16_t reg)
{
	uint16_t i;

	W5500_SCS_Low();//置W5500的SCS为低电平
			
	W5500_SPI_Send_Short(reg);//通过SPI写16位寄存器地址
	W5500_SPI_Send_Byte(FDM2|RWB_READ|(s*0x20+0x08));//通过SPI写控制字节,2个字节数据长度,读数据,选择端口s的寄存器

	i=W5500_SPI_Receive_Data();
	W5500_SPI_Send_Byte(0x00);//发送一个哑数据
	i=W5500_SPI_Receive_Data();//读取高位数据
	W5500_SPI_Send_Byte(0x00);//发送一个哑数据
	i = i<<8;
	i+=W5500_SPI_Receive_Data();//读取低位数据

	W5500_SCS_High();//置W5500的SCS为高电平
	return i;//返回读取到的寄存器数据
}

/*******************************************************************************
* 函数名  : Read_SOCK_Data_Buffer
* 描述    : 从W5500接收数据缓冲区中读取数据
* 输入    : s:端口号,*dat_ptr:数据保存缓冲区指针
* 输出    : 无
* 返回值  : 读取到的数据长度,rx_size个字节
* 说明    : 无
*******************************************************************************/
uint16_t Read_SOCK_Data_Buffer(SOCKET s, uint8_t *dat_ptr)
{
	uint16_t rx_size;
	uint16_t offset, offset1;
	uint16_t i;
	uint8_t j;

	rx_size=Read_W5500_SOCK_2Byte(s,Sn_RX_RSR);
	if(rx_size==0) return 0;//没接收到数据则返回
	if(rx_size>1460) rx_size=1460;

