zthxxx/STM32-W5500_TCP_Client/USER/W5500.c
/*******************************************************************************
* 函数名  : W5500_INT_EXTI_IRQHandler
* 描述    : W5500中断线中断服务函数(W5500 INT引脚中断服务函数)
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void W5500_INT_EXTI_IRQHandler(void)
{
	if(EXTI_GetITStatus(W5500_INT_EXTI_LINE) != RESET)
	{
		EXTI_ClearITPendingBit(W5500_INT_EXTI_LINE);
		W5500_Interrupt=1;
	}
}



/*******************************************************************************
* 函数名  : W5500_Interrupt_Process
* 描述    : W5500中断处理程序框架
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void W5500_Interrupt_Process(void)
{
	uint8_t i,j;
    while(1)
    {
        W5500_Interrupt=0;//清零中断标志
        i = Read_W5500_1Byte(IR);//读取中断标志寄存器
        Write_W5500_1Byte(IR, (i&0xf0));//回写清除中断标志

        if((i & CONFLICT) == CONFLICT)//IP地址冲突异常处理
        {
             //自己添加代码
        }

        if((i & UNREACH) == UNREACH)//UDP模式下地址无法到达异常处理
        {
            //自己添加代码
        }

        i=Read_W5500_1Byte(SIR);//读取端口中断标志寄存器	
        if((i & S0_INT) == S0_INT)//Socket0事件处理 
        {
            j=Read_W5500_SOCK_1Byte(0,Sn_IR);//读取Socket0中断标志寄存器
            Write_W5500_SOCK_1Byte(0,Sn_IR,j);
            if(j&IR_CON)//在TCP模式下,Socket0成功连接 
            {
                S0_State|=S_CONN;//网络连接状态0x02,端口完成连接，可以正常传输数据
            }
            if(j&IR_DISCON)//在TCP模式下Socket断开连接处理
            {
                Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);//关闭端口,等待重新打开连接 
                Socket_Init(0);		//指定Socket(0~7)初始化,初始化端口0
                S0_State=0;//网络连接状态0x00,端口连接失败
            }
            if(j&IR_SEND_OK)//Socket0数据发送完成,可以再次启动S_tx_process()函数发送数据 
            {
                S0_Data|=S_TRANSMITOK;//端口发送一个数据包完成 
            }
            if(j&IR_RECV)//Socket接收到数据,可以启动S_rx_process()函数 
            {
                S0_Data|=S_RECEIVE;//端口接收到一个数据包
            }
            if(j&IR_TIMEOUT)//Socket连接或数据传输超时处理 
            {
                Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);// 关闭端口,等待重新打开连接 
                S0_State=0;//网络连接状态0x00,端口连接失败
            }
        }

        if(Read_W5500_1Byte(SIR) == 0) 
            break;
    }
}


/*******************************************************************************
* 函数名  : W5500_Process_Socket_Data
* 描述    : W5500接收并发送接收到的数据
* 输入    : s:端口号
* 输出    : 无
* 返回值  : 无
* 说明    : 本过程先调用S_rx_process()从W5500的端口接收数据缓冲区读取数据,
*			然后将读取的数据从Rx_Buffer拷贝到Temp_Buffer缓冲区进行处理。
*			处理完毕，将数据从Temp_Buffer拷贝到Tx_Buffer缓冲区。调用S_tx_process()
*			发送数据。
*******************************************************************************/
void W5500_Process_Socket_Data(SOCKET s)
{
	uint16_t size;
	size=Read_SOCK_Data_Buffer(s, Rx_Buffer);
	memcpy(Tx_Buffer, Rx_Buffer, size);			
	Write_SOCK_Data_Buffer(s, Tx_Buffer, size);
}

